In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "names":['vikram','sparsh','rohit','mohit','utkarsh'],
    "marks":[10,9,8,7,6],
    "city":['sirsa','chitrakut','bikaner','jabalpur','kishangarh']
    
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     names  marks        city
0   vikram     10       sirsa
1   sparsh      9   chitrakut
2    rohit      8     bikaner
3    mohit      7    jabalpur
4  utkarsh      6  kishangarh

In [5]:
df.to_csv('friends.csv')
#it will excess in csv format

In [7]:
df.to_csv('friends_index_false.csv', index=False)

In [8]:
df.head(2)

    names  marks       city
0  vikram     10      sirsa
1  sparsh      9  chitrakut

In [9]:
df.tail(1)

     names  marks        city
4  utkarsh      6  kishangarh

In [10]:
df.describe()

           marks
count   5.000000
mean    8.000000
std     1.581139
min     6.000000
25%     7.000000
50%     8.000000
75%     9.000000
max    10.000000

In [12]:
count=pd.read_csv('friends.csv')

In [15]:
count['marks'][3]=9

C:\Users\Ankit\AppData\Local\Temp/ipykernel_604/3190950760.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  count['marks'][3]=9

In [16]:
count

   Unnamed: 0    names  marks        city
0           0   vikram     10       sirsa
1           1   sparsh      9   chitrakut
2           2    rohit      8     bikaner
3           3    mohit      9    jabalpur
4           4  utkarsh      6  kishangarh

In [22]:
count

   Unnamed: 0    names  marks        city
0           0   vikram     10       sirsa
1           1   sparsh      9   chitrakut
2           2    rohit      8     bikaner
3           3    mohit      9    jabalpur
4           4  utkarsh      6  kishangarh

In [23]:
count.T

                 0          1        2         3           4
Unnamed: 0       0          1        2         3           4
names       vikram     sparsh    rohit     mohit     utkarsh
marks           10          9        8         9           6
city         sirsa  chitrakut  bikaner  jabalpur  kishangarh

In [24]:
count.sort_index(axis=0,ascending=False)

   Unnamed: 0    names  marks        city
4           4  utkarsh      6  kishangarh
3           3    mohit      9    jabalpur
2           2    rohit      8     bikaner
1           1   sparsh      9   chitrakut
0           0   vikram     10       sirsa

In [25]:
type(count)

pandas.core.frame.DataFrame

In [26]:
count2=count

In [32]:
count.loc[0,0]=534

In [33]:
count

   Unnamed: 0    names  marks        city      0
0           0   vikram     10       sirsa  534.0
1           1   sparsh      9   chitrakut    NaN
2           2    rohit      8     bikaner    NaN
3           3    mohit      9    jabalpur    NaN
4           4  utkarsh      6  kishangarh    NaN

In [34]:
df=pd.DataFrame(dict1)

In [35]:
df

     names  marks        city
0   vikram     10       sirsa
1   sparsh      9   chitrakut
2    rohit      8     bikaner
3    mohit      7    jabalpur
4  utkarsh      6  kishangarh

In [44]:
df.loc[0,"names"]="vik"

In [46]:
df=pd.DataFrame(dict1)

In [50]:
df.drop(0,axis=1)

KeyError: '[0] not found in axis'

In [47]:
df

     names  marks        city
0   vikram     10       sirsa
1   sparsh      9   chitrakut
2    rohit      8     bikaner
3    mohit      7    jabalpur
4  utkarsh      6  kishangarh

In [51]:
df.loc[1,0]=8

In [52]:
df

     names  marks        city    0
0   vikram     10       sirsa  NaN
1   sparsh      8   chitrakut  8.0
2    rohit      8     bikaner  NaN
3    mohit      7    jabalpur  NaN
4  utkarsh      6  kishangarh  NaN

In [53]:
df.drop(0,axis=1)

     names  marks        city
0   vikram     10       sirsa
1   sparsh      8   chitrakut
2    rohit      8     bikaner
3    mohit      7    jabalpur
4  utkarsh      6  kishangarh

In [55]:
df.loc[(df['marks']<9)&(df['marks']>6)]

    names  marks       city    0
1  sparsh      8  chitrakut  8.0
2   rohit      8    bikaner  NaN
3   mohit      7   jabalpur  NaN

In [56]:
df.loc[2,"marks"]

8

In [58]:
df.iloc[2,1]

8

In [60]:
df.shape

(5, 4)